#ifndef PARAMETRS_H
#define PARAMETRS_H

#define h 0.006   // шаг по координате
#define t 0.002   // шаг по времени

//----------Константы в краев. условии------------//

#define alpha 0.9
#define sigma 5.67

//------------------------------------------------//

#define a 1.       // внешний радиус цилиндра
#define b 0.7      // внутренний радиус цилиндра

#define T 100      // конец временного промежутка (начало в 0)

//--------------Константы в уравнении-------------//

#define c1 400.    // c в области 0 < r < b  (теплопроводность)
#define c2 450.    // с в области b < r < a

#define ro1 8900.  // плотность
#define ro2 14000.

#define k1 2000.   // температуропроводность
#define k2 2000.

#define q1 400     // поток тепла
#define q2 1000

#define TT 300     // температура окружающей среды

#define SET_PARAMS(i) \
    if (x[i] < b) {   \
        c[i] = c1;    \
        ro[i] = ro1;  \
        k[i] = k1;    \
        q[i] = q1;    \
    } else {          \
        c[i] = c2;    \
        ro[i] = ro2;  \
        k[i] = k2;    \
        q[i] = q2;    \
    }

//------------------------------------------------//

#define N a/h     // число ячеек            

#define SIZE_X (int)(N + 2)          // размер массива координат
#define SIZE_T (int)((T - 0.) / t)   // размер массива времени

#endif
