#ifndef PARAMETRS_H
#define PARAMETRS_H

#define h 0.006     // шаг по координате
#define t 0.002     // шаг по времени

//----------Константы в краев. условии------------//

#define alpha 800   // коэффициент теплоотдачи
#define sigma 5.67*10e-8

//------------------------------------------------//

#define a 0.3       // внешний радиус цилиндра
#define b 0.1       // внутренний радиус цилиндра

#define T 7200      // конец временного промежутка (начало в 0)

//--------------Константы в уравнении-------------//

#define c1 920.     // c в области 0 < r < b  (теплопроводность)
#define c2 920.      // с в области b < r < a

#define ro1 2000.   // плотность
#define ro2 2000.

#define k1 0.9      // температуропроводность
#define k2 0.9

#define q1 2000        // поток тепла
#define q2 0

#define TT 300       // температура окружающей среды

#define SET_PARAMS(i) \
    if (x[i] < b) {   \
        c[i] = c1;    \
        ro[i] = ro1;  \
        k[i] = k1;    \
        q[i] = q1;    \
    } else {          \
        c[i] = c2;    \
        ro[i] = ro2;  \
        k[i] = k2;    \
        q[i] = q2;    \
    }

//------------------------------------------------//

#define N a/h     // число ячеек            

#define SIZE_X (int)(N + 2)          // размер массива координат
#define SIZE_T (int)((T - 0.) / t)   // размер массива времени

#endif
