#ifndef PARAMETRS_H
#define PARAMETRS_H

#define h 0.0001     // шаг по координате
#define t 0.002     // шаг по времени

//----------Константы в краев. условии------------//

#define alpha 500   // коэффициент теплоотдачи
#define sigma 5.67*1e-8

//------------------------------------------------//

#define a 1e-2       // внешний радиус цилиндра
#define b 5e-3       // внутренний радиус цилиндра

#define T 500      // конец временного промежутка (начало в 0)

//--------------Константы в уравнении-------------//

#define c1 300.     // c в области 0 < r < b  (теплопроводность)
#define c2 600.      // с в области b < r < a

#define ro1 11e+3   // плотность
#define ro2 8e+3

#define k1 10      // температуропроводность
#define k2 40

#define q1 2e+8        // поток тепла
#define q2 0

#define TT 293       // температура окружающей среды

#define SET_PARAMS(i) \
    if (x[i] < b) {   \
        c[i] = c1;    \
        ro[i] = ro1;  \
        k[i] = k1;    \
        q[i] = q1;    \
    } else {          \
        c[i] = c2;    \
        ro[i] = ro2;  \
        k[i] = k2;    \
        q[i] = q2;    \
    }

//------------------------------------------------//

#define N a/h     // число ячеек            

#define SIZE_X (int)(N + 2)          // размер массива координат
#define SIZE_T (int)((T - 0.) / t)   // размер массива времени

#endif
